{
  "backend/main.mo": "Main Motoko canister implementing content CRUD, user/admin access control, and storage for videos, events, gallery items, releases, tracks, artist profile, and user plans.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components with associated test IDs.",
  "frontend-file-summaries.txt": "Text file containing short human‑written summaries for key frontend files and components across the project.",
  "frontend/index.css": "Tailwind base/theme variable definitions for light and dark modes using OKLCH color tokens and global styling rules.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "React app router setup with all routes, global providers, and layout integration.",
  "frontend/src/components/admin/AdminLoginRequiredScreen.tsx": "UI screen shown when a user is unauthenticated, explaining admin Principal-based login and providing an Internet Identity login button.",
  "frontend/src/components/admin/forms/GalleryManager.tsx": "Admin CRUD interface for gallery items with image upload, edit/delete actions, and upload progress tracking.",
  "frontend/src/components/admin/forms/PlansManager.tsx": "UI for creating, editing, and deleting user subscription plans using dialogs and admin mutations.",
  "frontend/src/components/admin/forms/ProfileEditor.tsx": "Fetches and edits an artist profile, allowing updates to name, bio, and social links.",
  "frontend/src/components/admin/forms/ReleasesManager.tsx": "Manages music releases and associated tracks, with support for file uploads, editing, and deletion.",
  "frontend/src/components/admin/forms/ShowsManager.tsx": "Creates and updates event listings including date, venue, city, and ticket link.",
  "frontend/src/components/admin/forms/VideosManager.tsx": "Handles adding, editing, and deleting video entries with titles and platform links.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and a dropdown menu.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new users to enter and save their display name before continuing.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper with navigation, footer, and conditional profile setup dialog based on user identity and profile state.",
  "frontend/src/components/layout/SiteNav.tsx": "Responsive navigation bar that shows links, login button, and an admin link when applicable.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminMutations.ts": "React Query mutation hooks for admin actions like editing profiles, releases, tracks, and other content using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login/logout flow, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching profiles, media, events, gallery items, admin status, and user plans via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard that checks authentication and admin status, handles profile setup, and displays tabs for managing site content.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a grid of gallery images with captions and a modal viewer, showing skeletons while loading.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero section, artist profile data, social links, and an about section using fetched profile info.",
  "frontend/src/pages/PlansPage.tsx": "Plan selection page that requires login, loads available user plans, shows current plan, and allows assigning a new plan.",
  "frontend/src/pages/ReleasesPage.tsx": "Shows music releases with cover art, release dates, tracklists, and streaming links, with loading skeletons.",
  "frontend/src/pages/ShowsPage.tsx": "Displays upcoming events sorted by date with venue details and ticket links, with loading placeholders.",
  "frontend/src/pages/VideosPage.tsx": "Renders a list of videos with titles and external watch links, with skeletons while loading.",
  "frontend/src/utils/platformLinks.tsx": "Provides getPlatformInfo to detect platform names from URLs and return matching labels and icon components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in sessionStorage, and persisting or clearing them as needed.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON snapshot describing project state, features, requirements, and architectural notes for the music artist website."
}