{
  "kind": "build_request",
  "title": "Clarify Admin Dashboard login: Internet Identity only (no username/password)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Update the Admin Dashboard unauthenticated/loading gate so it no longer shows an indefinite “Loading...” screen when the user is not logged in. Instead, show an explicit Admin login screen that tells the user to log in using Internet Identity (via the existing site Login button) to access the admin dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "adim panle logon username or gmail or number  - \"prantiksarkarartist \"  \"muisc@prantiksarkarartist.com\" for lodin oly pass -\"prantiksarkarartist@12.    \"8910264917\"\""
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin while not authenticated shows a clear login-required state (not just a spinner).",
        "The page includes English user-facing text instructing the user to use Internet Identity to log in.",
        "The page provides a clear next action (e.g., a visible ‘Login’ button or instruction to use the Login button in the navigation)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add clear English guidance on the Admin Dashboard access control model: admin access is granted only to the Internet Identity Principal configured as admin, and the app must not support (or collect) username/email/phone + password login for admin access.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "adim panle logon username or gmail or number  - \"prantiksarkarartist \"  \"muisc@prantiksarkarartist.com\" for lodin oly pass -\"prantiksarkarartist@12.    \"8910264917\"\""
        ]
      },
      "acceptanceCriteria": [
        "The /admin experience includes English copy clarifying that admin access is based on Internet Identity Principal authorization.",
        "No UI is added that collects or stores admin credentials such as username/email/phone/password.",
        "The provided credential-like strings (\"prantiksarkarartist\", \"muisc@prantiksarkarartist.com\", \"8910264917\", \"prantiksarkarartist@12\") are not displayed back to end users and are not persisted anywhere in the app."
      ]
    }
  ],
  "constraints": [
    "Do not implement username/email/phone + password authentication (only Internet Identity authentication is supported).",
    "Do not store or persist any admin password/credentials in the frontend or backend.",
    "Do not edit files under frontend/src/components/ui (read-only shadcn components)."
  ],
  "nonGoals": [
    "Adding a new backend authentication system (passwords, email login, SMS/OTP, or third-party auth).",
    "Changing the existing admin authorization mechanism enforced by the backend (Principal-based admin checks)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}