{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin dashboard unauthenticated gate: show Internet Identity login-required screen",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Replace the /admin unauthenticated/loading gate with an explicit Internet Identity login-required screen and clear next action.",
      "acceptanceCriteria": [
        "Visiting /admin while not authenticated shows a clear login-required state (not just a spinner).",
        "The page includes English user-facing text instructing the user to use Internet Identity to log in.",
        "The page provides a clear next action (e.g., a visible ‘Login’ button or instruction to use the Login button in the navigation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminLoginRequiredScreen.tsx",
          "operation": "create",
          "description": "Create a dedicated Admin login-required screen UI that explains the user must authenticate via Internet Identity and provides a clear next action by rendering the existing LoginButton. Use existing shadcn/ui primitives (e.g., Card, Button styling via existing components) without editing any files under frontend/src/components/ui. Use the authorization (Internet Identity) model for the copy and UX. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Update gating logic to avoid showing an indefinite “Loading...” state when unauthenticated. Render the new AdminLoginRequiredScreen when identity is missing, show a spinner only for legitimate in-flight admin checks when authenticated, and keep the existing admin/unauthorized handling for non-admin authenticated users. Wire the new screen into this page so it is reachable at /admin. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add clear English copy on /admin that admin access is Principal-based via Internet Identity only, and explicitly avoid any username/email/phone/password admin login UI or persistence.",
      "acceptanceCriteria": [
        "The /admin experience includes English copy clarifying that admin access is based on Internet Identity Principal authorization.",
        "No UI is added that collects or stores admin credentials such as username/email/phone/password.",
        "The provided credential-like strings (\"prantiksarkarartist\", \"muisc@prantiksarkarartist.com\", \"8910264917\", \"prantiksarkarartist@12\") are not displayed back to end users and are not persisted anywhere in the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminLoginRequiredScreen.tsx",
          "operation": "modify",
          "description": "Add/adjust English guidance text stating: admin access is granted only to the Internet Identity Principal configured as admin; the app does not support username/email/phone + password admin login; and no admin credentials are collected or stored. Ensure none of the provided credential-like strings are ever shown in UI or stored. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Ensure the /admin flow surfaces the access-control model messaging where appropriate (unauthenticated and unauthorized states) while keeping the UI free of any credential collection fields. Confirm no credential-like strings are introduced into UI, state, logs, or persistence. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}